tutorials/multiphase/reactingMultiphaseEulerFoam/RAS/wallBoiling1D_3phase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (0.05 0 0)
    (0.05 2 0)
    (0 2 0)
    (0 0 0.1)
    (0.05 0 0.1)
    (0.05 2 0.1)
    (0 2 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 75 1) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type mappedPatch;
        offset          (0 0.1 0);
        sampleRegion    region0;
        sampleMode      nearestCell;
        samplePatch     none;

        faces
        (
            (1 5 4 0)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    wall1
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    wall2
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
);

// ************************************************************************* //
